Ran Plan for dir: `infrastructure/gcp/cloud-deployment/gcompute-engine-atlantis` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.gcompute-engine.local_file.ansible_vars[0] will be created
+ resource "local_file" "ansible_vars" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "ansible_vars.json"
      + id                   = (known after apply)
    }

  # module.gcompute-engine.local_file.private_key will be created
+ resource "local_file" "private_key" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0700"
      + file_permission      = "0400"
      + filename             = "id_rsa.pem"
      + id                   = (known after apply)
    }

  # module.gcompute-engine.null_resource.ansible_playbook[0] must be replaced
-/+ resource "null_resource" "ansible_playbook" {
      ~ id       = "2788583642528329673" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "playbook_checksum" = "eda4539667002320eb1074f5b285141bd203ca3e6a038a8e96d62cc1450dde16" -> "6e26ac0c3de6458ed6bc2bc56d24b738f4e5d607bd8a75de0b284e51cfee3f13"
        }
    }

Plan: 3 to add, 0 to change, 1 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infrastructure/gcp/cloud-deployment/gcompute-engine-atlantis`
* :put_litter_in_its_place: To **delete** this plan click [here](http://ols-dev-gce-atlantis:4141/lock?id=greyhats13%252Fol_shop%252Finfrastructure%252Fgcp%252Fcloud-deployment%252Fgcompute-engine-atlantis%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infrastructure/gcp/cloud-deployment/gcompute-engine-atlantis`
</details>
Plan: 3 to add, 0 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`